# RebarContainerIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarContainerIterator Properties
RebarContainerIterator Class See Also
---
The RebarContainerIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Gets the item at the current position of the iterator. |
| CurrentObject |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RebarContainerIterator Class
Autodesk.Revit.DB.Structure Namespace